## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                      |
|----------|------------------------------------------------|
| add      | `aws_quicksight_data_set.notification_history` |
|          | `aws_quicksight_data_set.services_history`     |
|          | `aws_quicksight_data_set.templates`            |
|          | `aws_quicksight_data_set.templates_history`    |
| recreate | `aws_quicksight_data_set.jobs`                 |
|          | `aws_quicksight_data_set.organisation`         |
|          | `aws_quicksight_data_set.services`             |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/6274983241).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_quicksight_data_set.jobs is tainted, so must be replaced
-/+ resource "aws_quicksight_data_set" "jobs" {
      ~ arn            = "arn:aws:quicksight:ca-central-1:239043911459:dataset/jobs" -> (known after apply)
      ~ aws_account_id = "239043911459" -> (known after apply)
      ~ id             = "239043911459,jobs" -> (known after apply)
        name           = "Jobs"
      ~ output_columns = [
          - {
              - description = ""
              - name        = "id"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "created_at"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "updated_at"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "api_key_id"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "job_status"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "notification_count"
              - type        = "INTEGER"
            },
          - {
              - description = ""
              - name        = "notifications_delivered"
              - type        = "INTEGER"
            },
          - {
              - description = ""
              - name        = "notifications_failed"
              - type        = "INTEGER"
            },
          - {
              - description = ""
              - name        = "notifications_sent"
              - type        = "INTEGER"
            },
          - {
              - description = ""
              - name        = "processing_finished"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "processing_started"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "scheduled_for"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "service_id"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "template_id"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "template_version"
              - type        = "INTEGER"
            },
        ] -> (known after apply)
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ data_set_usage_configuration {
          ~ disable_use_as_direct_query_source = false -> (known after apply)
          ~ disable_use_as_imported_source     = false -> (known after apply)
        }

      - logical_table_map {
          - alias                = "jobs" -> null
          - logical_table_map_id = "jobs" -> null

          - source {
              - physical_table_id = "jobs" -> null
            }
        }
      + logical_table_map {
          + alias                = (known after apply)
          + logical_table_map_id = (known after apply)

          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = (known after apply)
                  + new_column_name = (known after apply)
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }

          + source {
              + data_set_arn      = (known after apply)
              + physical_table_id = (known after apply)

              + join_instruction {
                  + left_operand  = (known after apply)
                  + on_clause     = (known after apply)
                  + right_operand = (known after apply)
                  + type          = (known after apply)

                  + left_join_key_properties {
                      + unique_key = (known after apply)
                    }

                  + right_join_key_properties {
                      + unique_key = (known after apply)
                    }
                }
            }
        }


      + physical_table_map {
          + physical_table_map_id = "jobs"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "jobs"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "api_key_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_count"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_delivered"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_failed"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "notifications_sent"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "processing_finished"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "processing_started"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "scheduled_for"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
            }

          + s3_source {
              + data_source_arn = (known after apply)

              + input_columns {
                  + name = (known after apply)
                  + type = (known after apply)
                }

              + upload_settings {
                  + contains_header = (known after apply)
                  + delimiter       = (known after apply)
                  + format          = (known after apply)
                  + start_from_row  = (known after apply)
                  + text_qualifier  = (known after apply)
                }
            }
        }
      - physical_table_map {
          - physical_table_map_id = "jobs" -> null

          - relational_table {
              - data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging" -> null
              - name            = "jobs" -> null

              - input_columns {
                  - name = "id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "created_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "updated_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "api_key_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "job_status" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "notification_count" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "notifications_delivered" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "notifications_failed" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "notifications_sent" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "processing_finished" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "processing_started" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "scheduled_for" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "service_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "template_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "template_version" -> null
                  - type = "INTEGER" -> null
                }
            }
        }
        # (2 unchanged blocks hidden)
    }

  # aws_quicksight_data_set.notification_history will be created
  + resource "aws_quicksight_data_set" "notification_history" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notification_history"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Notification history"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + data_set_usage_configuration {
          + disable_use_as_direct_query_source = (known after apply)
          + disable_use_as_imported_source     = (known after apply)
        }

      + logical_table_map {
          + alias                = (known after apply)
          + logical_table_map_id = (known after apply)

          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = (known after apply)
                  + new_column_name = (known after apply)
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }

          + source {
              + data_set_arn      = (known after apply)
              + physical_table_id = (known after apply)

              + join_instruction {
                  + left_operand  = (known after apply)
                  + on_clause     = (known after apply)
                  + right_operand = (known after apply)
                  + type          = (known after apply)

                  + left_join_key_properties {
                      + unique_key = (known after apply)
                    }

                  + right_join_key_properties {
                      + unique_key = (known after apply)
                    }
                }
            }
        }

      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
        }
      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
        }

      + physical_table_map {
          + physical_table_map_id = "notification-history"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "notification_history"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
              + input_columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "sent_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
            }

          + s3_source {
              + data_source_arn = (known after apply)

              + input_columns {
                  + name = (known after apply)
                  + type = (known after apply)
                }

              + upload_settings {
                  + contains_header = (known after apply)
                  + delimiter       = (known after apply)
                  + format          = (known after apply)
                  + start_from_row  = (known after apply)
                  + text_qualifier  = (known after apply)
                }
            }
        }
    }

  # aws_quicksight_data_set.organisation is tainted, so must be replaced
-/+ resource "aws_quicksight_data_set" "organisation" {
      ~ arn            = "arn:aws:quicksight:ca-central-1:239043911459:dataset/organisation" -> (known after apply)
      ~ aws_account_id = "239043911459" -> (known after apply)
      ~ id             = "239043911459,organisation" -> (known after apply)
        name           = "Organisation"
      ~ output_columns = [
          - {
              - description = ""
              - name        = "id"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "created_at"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "updated_at"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "name"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "organisation_type"
              - type        = "STRING"
            },
        ] -> (known after apply)
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ data_set_usage_configuration {
          ~ disable_use_as_direct_query_source = false -> (known after apply)
          ~ disable_use_as_imported_source     = false -> (known after apply)
        }

      - logical_table_map {
          - alias                = "organisation" -> null
          - logical_table_map_id = "organisation" -> null

          - source {
              - physical_table_id = "organisation" -> null
            }
        }
      + logical_table_map {
          + alias                = (known after apply)
          + logical_table_map_id = (known after apply)

          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = (known after apply)
                  + new_column_name = (known after apply)
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }

          + source {
              + data_set_arn      = (known after apply)
              + physical_table_id = (known after apply)

              + join_instruction {
                  + left_operand  = (known after apply)
                  + on_clause     = (known after apply)
                  + right_operand = (known after apply)
                  + type          = (known after apply)

                  + left_join_key_properties {
                      + unique_key = (known after apply)
                    }

                  + right_join_key_properties {
                      + unique_key = (known after apply)
                    }
                }
            }
        }


      + physical_table_map {
          + physical_table_map_id = "organisation"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "organisation"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "organisation_type"
                  + type = "STRING"
                }
            }

          + s3_source {
              + data_source_arn = (known after apply)

              + input_columns {
                  + name = (known after apply)
                  + type = (known after apply)
                }

              + upload_settings {
                  + contains_header = (known after apply)
                  + delimiter       = (known after apply)
                  + format          = (known after apply)
                  + start_from_row  = (known after apply)
                  + text_qualifier  = (known after apply)
                }
            }
        }
      - physical_table_map {
          - physical_table_map_id = "organisation" -> null

          - relational_table {
              - data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging" -> null
              - name            = "organisation" -> null

              - input_columns {
                  - name = "id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "created_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "updated_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "name" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "organisation_type" -> null
                  - type = "STRING" -> null
                }
            }
        }
        # (2 unchanged blocks hidden)
    }

  # aws_quicksight_data_set.services is tainted, so must be replaced
-/+ resource "aws_quicksight_data_set" "services" {
      ~ arn            = "arn:aws:quicksight:ca-central-1:239043911459:dataset/services" -> (known after apply)
      ~ aws_account_id = "239043911459" -> (known after apply)
      ~ id             = "239043911459,services" -> (known after apply)
        name           = "Services"
      ~ output_columns = [
          - {
              - description = ""
              - name        = "id"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "created_at"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "updated_at"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "active"
              - type        = "INTEGER"
            },
          - {
              - description = ""
              - name        = "count_as_live"
              - type        = "INTEGER"
            },
          - {
              - description = ""
              - name        = "go_live_at"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "name"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "message_limit"
              - type        = "INTEGER"
            },
          - {
              - description = ""
              - name        = "rate_limit"
              - type        = "INTEGER"
            },
          - {
              - description = ""
              - name        = "sms_limit"
              - type        = "INTEGER"
            },
        ] -> (known after apply)
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ data_set_usage_configuration {
          ~ disable_use_as_direct_query_source = false -> (known after apply)
          ~ disable_use_as_imported_source     = false -> (known after apply)
        }

      - logical_table_map {
          - alias                = "services" -> null
          - logical_table_map_id = "services" -> null

          - source {
              - physical_table_id = "services" -> null
            }
        }
      + logical_table_map {
          + alias                = (known after apply)
          + logical_table_map_id = (known after apply)

          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = (known after apply)
                  + new_column_name = (known after apply)
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }

          + source {
              + data_set_arn      = (known after apply)
              + physical_table_id = (known after apply)

              + join_instruction {
                  + left_operand  = (known after apply)
                  + on_clause     = (known after apply)
                  + right_operand = (known after apply)
                  + type          = (known after apply)

                  + left_join_key_properties {
                      + unique_key = (known after apply)
                    }

                  + right_join_key_properties {
                      + unique_key = (known after apply)
                    }
                }
            }
        }


      + physical_table_map {
          + physical_table_map_id = "services"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "services"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "active"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "count_as_live"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "go_live_at"
                  + type = "DATETIME"
                }
              + input_columns {
           ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notification_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

32 tests, 17 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
